# Creating a new DataFrame

In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
%matplotlib inline
import matplotlib as mpl 
mpl.rcParams.update(mpl.rcParamsDefault)

In [2]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],
        'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'RMadrid', 'ValenciaCF',
                 'ValenciaCF', 'ValenciaCF'],
        'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]
    }
football = pd.DataFrame(data=data, columns=['year', 'team', 'wins', 'draws', 'losses'])
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

In [3]:
edu = pd.read_csv(
    filepath_or_buffer = 'data/educ_figdp_1_Data.csv',
    usecols = ['TIME', 'GEO', 'Value'],
    na_values = ':'
)
edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

Beside this, Pandas also has functions for reading files with formats such as Excel, HDF5, tabulated files or even the content from the clipboard (`read_excel(), read_hdf(), read_table(), read_clipboard()`). Whichever function we use, the result of reading a file is stored as a DataFrame structure.

`head()` method returns the first five rows.

In [4]:
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

`tail()` method retuns the last five rows by default.

In [5]:
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

If we want to know the names of the columns or the names of the indexes, we can use the DataFrame attributes ***columns*** and ***index*** respectively. The names of the columns or indexes can be changed by assigning a new list of the same length to these attributes.

In [6]:
edu.columns

Index(['TIME', 'GEO', 'Value'], dtype='object')

In [7]:
edu.index

RangeIndex(start=0, stop=384, step=1)

The values of any DataFrame can be retrieved as a Python array by calling its ***values*** attribute.

In [8]:
edu.values

array([[2000, 'European Union (28 countries)', nan],
       [2001, 'European Union (28 countries)', nan],
       [2002, 'European Union (28 countries)', 5.0],
       ...,
       [2009, 'Finland', 6.81],
       [2010, 'Finland', 6.85],
       [2011, 'Finland', 6.76]], dtype=object)

`describe()` method returns a quick statistical information on all the numeric columns in a data frame.

In [9]:
edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

# Selection
If we want to select a subset of data from a DataFrame, it is necessary to indicate this subset using square brackets **[]** after the `DataFrame`. The subset can be specified in several ways. If we want to select only one column from a `DataFrame`, we only need to put its name between the square brackets. The result will be a `Series` data structure, not a `DataFrame`, because only one column is retrieved.

In [10]:
edu['Value']

0       NaN
1       NaN
2      5.00
3      5.03
4      4.95
       ...
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value, Length: 384, dtype: float64

If we want to select a subset of rows from a `DataFrame`, we can do so by indicating a range of rows separated by `:` inside the square brackets. This is commonly known as a `slice of rows`.

In [11]:
edu[7:16]

    TIME                            GEO  Value
7   2007  European Union (28 countries)   4.92
8   2008  European Union (28 countries)   5.04
9   2009  European Union (28 countries)   5.38
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99
14  2002  European Union (27 countries)   5.00
15  2003  European Union (27 countries)   5.04

Note that the slice does not use the index labels as references, but the position. In this case, the labels of the rows simply coincide with the position of the rows.

If we want to select a subset of columns and rows using the labels as our references instead of the positions, we can use `loc` indexing:

In [12]:
edu.loc[90:100, ['TIME', 'GEO']]

     TIME       GEO
90   2006   Belgium
91   2007   Belgium
92   2008   Belgium
93   2009   Belgium
94   2010   Belgium
95   2011   Belgium
96   2000  Bulgaria
97   2001  Bulgaria
98   2002  Bulgaria
99   2003  Bulgaria
100  2004  Bulgaria

# Filtering Data
Another way to select a subset of data is by applying ***Boolean indexing***. This indexing is commonly known as a ***filter***. For instance, if we want to filter those values less than or equal to 6.5, we can do it like this:

In [13]:
edu[edu['Value'] > 6.5].head()

     TIME      GEO  Value
93   2009  Belgium   6.57
94   2010  Belgium   6.58
95   2011  Belgium   6.55
120  2000  Denmark   8.28
121  2001  Denmark   8.44

## Filtering Missing Values
Pandas uses the special value **NaN** (not a number) to represent missing values. In Python, **NaN** is a special floating-point value returned by certain operations when one of their results ends in an undefined value. 

A subtle feature of **NaN** values is that two **NaN** are never equal. Because of this, the only safe way to tell whether or not a value is missing in a `DataFrame` is by using the `isnull()` function. Indeed, this function can be used to filter rows with missing values:

In [14]:
edu[edu['Value'].isnull()].tail()

     TIME         GEO  Value
262  2010  Luxembourg    NaN
263  2011  Luxembourg    NaN
342  2006     Romania    NaN
344  2008     Romania    NaN
348  2000    Slovenia    NaN

# Manipulating Data
One of the most straightforward things we can do is to operate with columns or rows using aggregation functions. The following list shows the most common aggregation functions.

| **Function** | **Description**                      |
|:--------:|:---------------------------------:|
| count()  | Number of non-null observations   |
| sum()    | Sum of values                     |
| mean()   | Mean of values                    |
| median() | Arithmetic median of values       |
| min()    | Minimum                           |
| max()    | Maximum                           |
| prod()   | Product of values                 |
| std()    | Unbiased standard deviation       |
| var()    | Unbiased variance                 |

- Applied to a row or column --> returns a number
- Applied to a DataFrame or a selection of rows and columns
    - Specify if the function should be applied to the rows for each column --> `axis=0`
    - Specify if the function should be applied to the columns for each row --> `axis=1`

In [15]:
edu.max(axis=0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object

These functions are specific to Pandas, not the generic Python functions.

In [16]:
print('Pandas max function: ', edu['Value'].max())
print('Python max function: ', max(edu['Value']))

Pandas max function:  8.81
Python max function:  nan

In [17]:
s = edu['Value'] / 100 
s.head()

0       NaN
1       NaN
2    0.0500
3    0.0503
4    0.0495
Name: Value, dtype: float64

We can apply any function to a DataFrame or Series using `apply` method.

In [18]:
s = edu['Value'].apply(np.sqrt)
s.head()

0         NaN
1         NaN
2    2.236068
3    2.242766
4    2.224860
Name: Value, dtype: float64

Using `lambda` $\lambda$-function with `apply` method

In [19]:
s = edu['Value'].apply(lambda d: d**2)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

Setting new values in the DataFrame

In [20]:
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.head()

   TIME                            GEO  Value  ValueNorm
0  2000  European Union (28 countries)    NaN        NaN
1  2001  European Union (28 countries)    NaN        NaN
2  2002  European Union (28 countries)   5.00   0.567537
3  2003  European Union (28 countries)   5.03   0.570942
4  2004  European Union (28 countries)   4.95   0.561862

Using `drop` function to remove column from the DataFrame.

All manipulating functions in Pandas return a copy of the modified data, instead of overwriting the DataFrame.

`inplace` keyword can be set to `True` if the original values of DataFrame should be overwritten.

In [21]:
edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

`concat` function: To insert a new row at the bottom of the DataFrame.

In [22]:
edu = pd.concat(
    [
        edu, 
        pd.DataFrame(
            {
                'TIME': 2000,
                'Value': 5.00,
                'GEO': 'Nepal'
            },
            index = [max(edu.index)+1]
        )
    ]
)
edu.tail()

     TIME      GEO  Value
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76
384  2000    Nepal   5.00

In [23]:
edu.drop(max(edu.index), axis=0, inplace=True)
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

`dropna()` function:
- Delete any row that contains an `NaN` value by setting `how` keyword to `any`
- Restricting to a subset of columns by setting `subset` keyword

In [24]:
eduDrop = edu.dropna(how='any', subset=['Value'], axis=0)
eduDrop.head()

   TIME                            GEO  Value
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95
5  2005  European Union (28 countries)   4.92
6  2006  European Union (28 countries)   4.91